
urls =[
    #"https://weread.qq.com/web/category/{type}"
    "https://weread.qq.com/web/bookListInCategory/all?maxIndex=40&rank=1",
    "https://weread.qq.com/web/bookListInCategory/400000?maxIndex=40",
]

TopType = [
    #总榜，飙升，新书，男生小说，女生小说
    "all","rising","newbook","novel_male","novel_female",
]

OtherType = [
    #男生小说榜
    #东方玄幻榜，都市小说榜，仙侠武侠榜，异界大陆榜，异术超能榜，玄幻奇幻榜
    "1900001","1900002","1900003","1900004","1900005","1900006",
    # 同人二次元，历史架空，游戏竞技，科幻未来，时空穿梭，悬疑灵异，军事小说
    "1900007","1900008","1900009","1900010","1900011","1900012","1900013",
    #女生小说榜
    #穿越架空，豪门世家，现代言情，玄幻言情，古代言情，快穿小说
    "2000001","2000002","2000003","2000004","2000005","2000006",
    #宫闱宅斗，仙侠奇缘，重生异能，经商种田，青春言情，科幻神秘，游戏同人
    "2000007","2000008","2000009","2000010","2000011","2000012","2000013",
    #现代小说榜，
    "100000",
    #影视原著榜
    #全部，热门影视，高分影视，最新播映，国产影视，海外影视，影视综合，明星传记，其他
    "200000","200001","200002","200003","200004","200005","200006","200007","200008",
    #情感小说榜
    "300000",
    #悬疑恐怖榜
    #全部，侦探推理，恐怖惊悚
    "400000","400001","400002",
    #玄幻精品榜
    "500000",
    #经典小说榜
    #全部，世界名著，古典小说，外国经典
    "600000","600001","600002","600003",
    #科幻经典榜
    "700000",
    #武侠经典榜
    "800000",
    #文学艺术榜
    #全部 ,随笔，文集，传记，诗歌，文学理论，纪实文学，戏剧，民间文学，艺术
    "900000","900001","900002","900003","900004","900005","900006","900007","900008","900009",
    #个人成长榜
    #全部，人生哲学，职场，沟通表达，情绪心灵，认知思维，两性婚姻，励志
    "1000000","1000001","1000002","1000003","1000004","1000005","1000006","1000007",
    #哲学社科榜
    #全部，心理学，哲学，社会，文化，宗教，人类，法律法规，法律读物
    "1100000","1100001","1100002","1100003","1100004","1100005","1100006","1100007","1100008",
    #历史榜
    #全部，中国史，历史小说，历史人物，世界史，历史典籍，历史随笔，其他
    "1200000","1200001","1200002","1200003","1200004","1200005","1200006","1200007",
    #生活榜
    #全部，健康，美食，时尚美容，居家，旅游，游戏，星座占卜，手工。
    "1300000","1300002","1300003","1300004","1300005","1300006","1300007","1300008","1300009",
    #经济理财榜
    #全部，经济学著作，财经人物，经济管理，其他，理财
    "1400000","1400001","1400002","1400003","1400004","1400005",
    #教育榜
    #全部，育儿家教，少儿教育，外语，教辅，考试，体育，英文书，工具书，其他
    "1500000","1500001","1500002","1500003","1500004","1500005","1500006","1500007","1500008","1500009",
    #军事政治榜
    #全部，政治，军事
    "1600000","1600001","1600002",
    #科学科技榜
    #全部，计算机，自然科学，医学，工业技术，建筑，农林牧业
    "1700000","1700001","1700002","1700003","1700004","1700005","1700006",
]
